app/controllers/campanhas_controller.rb

SELECT "campanhas".* FROM "campanhas"
---
  def index
    @campanhas = Campanha.all

SELECT "campanhas".* FROM "campanhas" WHERE ("campanhas"."id" = 1) LIMIT 1
---
  def show
    @campanha = Campanha.find(params[:id])

SELECT "campanhas".* FROM "campanhas" WHERE ("campanhas"."id" = 1) LIMIT 1
---
  def edit
    @campanha = Campanha.find(params[:id])

INSERT INTO "campanhas" ("created_at", "df", "nome", "premio", "tweet", "updated_at") VALUES ('2010-08-04 03:09:24.208832', '2010-08-04 03:09:00.000000', 'Product campaign', 'A car!', 'Product Blog: Article details how entrepreneurs use Basecamp and other tools to run an office-less business http://bit.ly/dB3qOA', '2010-08-04 03:09:24.208832')
---
  def create
    @campanha = Campanha.new(params[:campanha])
    if @campanha.save

SELECT "campanhas".* FROM "campanhas" WHERE ("campanhas"."id" = 1) LIMIT 1
UPDATE "campanhas" SET "tweet" = 'Product Blog: Article details how entrepreneurs use Basecamp and other tools to run an office-less business http://bit.ly/dB3qOA - Tweet it!', "updated_at" = '2010-08-04 04:41:55.961356' WHERE ("campanhas"."id" = 1)
---
  def update
    @campanha = Campanha.find(params[:id])
    if @campanha.update_attributes(params[:campanha])

SELECT "campanhas".* FROM "campanhas" WHERE ("campanhas"."id" = 1) LIMIT 1
DELETE FROM "campanhas" WHERE ("campanhas"."id" = 1)
---
  def destroy
    @campanha = Campanha.find(params[:id])
    @campanha.destroy